Revit 2026 API

# FabricationPartSaveAsFabricationJob Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> SaveAsFabricationJob(
	Document document,
	ISet<ElementId> ids,
	string filename,
	FabricationSaveJobOptions saveOptions
)
```
```vb
Public Shared Function SaveAsFabricationJob (
	document As Document,
	ids As ISet(Of ElementId),
	filename As String,
	saveOptions As FabricationSaveJobOptions
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ SaveAsFabricationJob(
	Document^ document,
	ISet<ElementId^>^ ids,
	String^ filename,
	FabricationSaveJobOptions^ saveOptions
)
```
```fsharp
static member SaveAsFabricationJob :
        document : Document *
        ids : ISet<ElementId> *
        filename : string *
        saveOptions : FabricationSaveJobOptions -> ISet<ElementId>
```

#### Parameters

document Document

ids ISetElementId

filename String

saveOptions FabricationSaveJobOptions

#### Return Value

ISetElementId

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace